Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ1024EFK064.atdf
      <value-group caption="Identifier Receive Mode bit" name="C1RXM3__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C1RXM3__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Extended Identifier bits" name="C2RXM3__EID">
         <value caption="Include bit, EIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit EIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="Identifier Receive Mode bit" name="C2RXM3__MIDE">
         <value caption="Match only message types (standard/extended address) that correspond to the EXID bit in filter" name="" value="0x1"/>
         <value caption="Match either standard or extended address message if filters match (that is, if (Filter SID) = (Message SID) or if (FILTER SID/EID) = (Message SID/EID))" name="" value="0x0"/>
      </value-group>
      <value-group caption="Standard Identifier bits" name="C2RXM3__SID">
         <value caption="Include bit, SIDx, in filter comparison" name="" value="0x1"/>
         <value caption="Bit SIDx is dont care in filter operation" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON0__FSEL0">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 29" name="" value="0x1d"/>
         <value caption="Message matching filter is stored in FIFO buffer 28" name="" value="0x1c"/>
         <value caption="Message matching filter is stored in FIFO buffer 27" name="" value="0x1b"/>
         <value caption="Message matching filter is stored in FIFO buffer 26" name="" value="0x1a"/>
         <value caption="Message matching filter is stored in FIFO buffer 25" name="" value="0x19"/>
         <value caption="Message matching filter is stored in FIFO buffer 24" name="" value="0x18"/>
         <value caption="Message matching filter is stored in FIFO buffer 23" name="" value="0x17"/>
         <value caption="Message matching filter is stored in FIFO buffer 22" name="" value="0x16"/>
         <value caption="Message matching filter is stored in FIFO buffer 21" name="" value="0x15"/>
         <value caption="Message matching filter is stored in FIFO buffer 20" name="" value="0x14"/>
         <value caption="Message matching filter is stored in FIFO buffer 19" name="" value="0x13"/>
         <value caption="Message matching filter is stored in FIFO buffer 18" name="" value="0x12"/>
         <value caption="Message matching filter is stored in FIFO buffer 17" name="" value="0x11"/>
         <value caption="Message matching filter is stored in FIFO buffer 16" name="" value="0x10"/>
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 0 Mask Select bits" name="C1FLTCON0__MSEL0">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 0 Enable bit" name="C1FLTCON0__FLTEN0">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON0__FSEL1">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 29" name="" value="0x1d"/>
         <value caption="Message matching filter is stored in FIFO buffer 28" name="" value="0x1c"/>
         <value caption="Message matching filter is stored in FIFO buffer 27" name="" value="0x1b"/>
         <value caption="Message matching filter is stored in FIFO buffer 26" name="" value="0x1a"/>
         <value caption="Message matching filter is stored in FIFO buffer 25" name="" value="0x19"/>
         <value caption="Message matching filter is stored in FIFO buffer 24" name="" value="0x18"/>
         <value caption="Message matching filter is stored in FIFO buffer 23" name="" value="0x17"/>
         <value caption="Message matching filter is stored in FIFO buffer 22" name="" value="0x16"/>
         <value caption="Message matching filter is stored in FIFO buffer 21" name="" value="0x15"/>
         <value caption="Message matching filter is stored in FIFO buffer 20" name="" value="0x14"/>
         <value caption="Message matching filter is stored in FIFO buffer 19" name="" value="0x13"/>
         <value caption="Message matching filter is stored in FIFO buffer 18" name="" value="0x12"/>
         <value caption="Message matching filter is stored in FIFO buffer 17" name="" value="0x11"/>
         <value caption="Message matching filter is stored in FIFO buffer 16" name="" value="0x10"/>
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 1 Mask Select bits" name="C1FLTCON0__MSEL1">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 1 Enable bit" name="C1FLTCON0__FLTEN1">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON0__FSEL2">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 29" name="" value="0x1d"/>
         <value caption="Message matching filter is stored in FIFO buffer 28" name="" value="0x1c"/>
         <value caption="Message matching filter is stored in FIFO buffer 27" name="" value="0x1b"/>
         <value caption="Message matching filter is stored in FIFO buffer 26" name="" value="0x1a"/>
         <value caption="Message matching filter is stored in FIFO buffer 25" name="" value="0x19"/>
         <value caption="Message matching filter is stored in FIFO buffer 24" name="" value="0x18"/>
         <value caption="Message matching filter is stored in FIFO buffer 23" name="" value="0x17"/>
         <value caption="Message matching filter is stored in FIFO buffer 22" name="" value="0x16"/>
         <value caption="Message matching filter is stored in FIFO buffer 21" name="" value="0x15"/>
         <value caption="Message matching filter is stored in FIFO buffer 20" name="" value="0x14"/>
         <value caption="Message matching filter is stored in FIFO buffer 19" name="" value="0x13"/>
         <value caption="Message matching filter is stored in FIFO buffer 18" name="" value="0x12"/>
         <value caption="Message matching filter is stored in FIFO buffer 17" name="" value="0x11"/>
         <value caption="Message matching filter is stored in FIFO buffer 16" name="" value="0x10"/>
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 2 Mask Select bits" name="C1FLTCON0__MSEL2">
         <value caption="Acceptance Mask 3 selected" name="" value="0x3"/>
         <value caption="Acceptance Mask 2 selected" name="" value="0x2"/>
         <value caption="Acceptance Mask 1 selected" name="" value="0x1"/>
         <value caption="Acceptance Mask 0 selected" name="" value="0x0"/>
      </value-group>
      <value-group caption="Filter 2 Enable bit" name="C1FLTCON0__FLTEN2">
         <value caption="Filter is enabled" name="" value="0x1"/>
         <value caption="Filter is disabled" name="" value="0x0"/>
      </value-group>
      <value-group caption="FIFO Selection bits" name="C1FLTCON0__FSEL3">
         <value caption="Message matching filter is stored in FIFO buffer 31" name="" value="0x1f"/>
         <value caption="Message matching filter is stored in FIFO buffer 30" name="" value="0x1e"/>
         <value caption="Message matching filter is stored in FIFO buffer 29" name="" value="0x1d"/>
         <value caption="Message matching filter is stored in FIFO buffer 28" name="" value="0x1c"/>
         <value caption="Message matching filter is stored in FIFO buffer 27" name="" value="0x1b"/>
         <value caption="Message matching filter is stored in FIFO buffer 26" name="" value="0x1a"/>
         <value caption="Message matching filter is stored in FIFO buffer 25" name="" value="0x19"/>
         <value caption="Message matching filter is stored in FIFO buffer 24" name="" value="0x18"/>
         <value caption="Message matching filter is stored in FIFO buffer 23" name="" value="0x17"/>
         <value caption="Message matching filter is stored in FIFO buffer 22" name="" value="0x16"/>
         <value caption="Message matching filter is stored in FIFO buffer 21" name="" value="0x15"/>
         <value caption="Message matching filter is stored in FIFO buffer 20" name="" value="0x14"/>
         <value caption="Message matching filter is stored in FIFO buffer 19" name="" value="0x13"/>
         <value caption="Message matching filter is stored in FIFO buffer 18" name="" value="0x12"/>
         <value caption="Message matching filter is stored in FIFO buffer 17" name="" value="0x11"/>
         <value caption="Message matching filter is stored in FIFO buffer 16" name="" value="0x10"/>
         <value caption="Message matching filter is stored in FIFO buffer 15" name="" value="0xf"/>
         <value caption="Message matching filter is stored in FIFO buffer 14" name="" value="0xe"/>
         <value caption="Message matching filter is stored in FIFO buffer 13" name="" value="0xd"/>
         <value caption="Message matching filter is stored in FIFO buffer 12" name="" value="0xc"/>
         <value caption="Message matching filter is stored in FIFO buffer 11" name="" value="0xb"/>
         <value caption="Message matching filter is stored in FIFO buffer 10" name="" value="0xa"/>
         <value caption="Message matching filter is stored in FIFO buffer 9" name="" value="0x9"/>
         <value caption="Message matching filter is stored in FIFO buffer 8" name="" value="0x8"/>
         <value caption="Message matching filter is stored in FIFO buffer 7" name="" value="0x7"/>
         <value caption="Message matching filter is stored in FIFO buffer 6" name="" value="0x6"/>
         <value caption="Message matching filter is stored in FIFO buffer 5" name="" value="0x5"/>
         <value caption="Message matching filter is stored in FIFO buffer 4" name="" value="0x4"/>
         <value caption="Message matching filter is stored in FIFO buffer 3" name="" value="0x3"/>
         <value caption="Message matching filter is stored in FIFO buffer 2" name="" value="0x2"/>
         <value caption="Message matching filter is stored in FIFO buffer 1" name="" value="0x1"/>
         <value caption="Message matching filter is stored in FIFO buffer 0" name="" value="0x0"/>
      </value-group>
