Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-EF_DFP/1.3.57/atdf/PIC32MZ1024EFK064.atdf
      <value-group caption="Transmit Polarity Inversion bit" name="U6STA__UTXINV">
         <value caption="(If IrDA mode is disabled (i.e." name="" value="0x1"/>
         <value caption="(If IrDA mode is disabled (i.e." name="" value="0x0"/>
      </value-group>
      <value-group caption="TX Interrupt Mode Selection bits" name="U6STA__UTXISEL">
         <value caption="Reserved" name="" value="0x3"/>
         <value caption="Interrupt is generated and asserted while the transmit buffer is empty" name="" value="0x2"/>
         <value caption="Interrupt is generated and asserted when all characters have been transmitted" name="" value="0x1"/>
         <value caption="Interrupt is generated and asserted while the transmit buffer contains at least one empty space" name="" value="0x0"/>
      </value-group>
      <value-group caption="Automatic Address Detect Mode Enable bit" name="U6STA__ADM_EN">
         <value caption="Automatic Address Detect mode is enabled" name="" value="0x1"/>
         <value caption="Automatic Address Detect mode is disabled" name="" value="0x0"/>
      </value-group>
   </module>
   <module caption="" id="00124" name="USB" version="1">
      <register-group name="USB">
         <register caption="USB Control Status Register 0" name="USBCSR0" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000007F" name="FUNC"/>
            <bitfield caption="Suspend Mode Enable bit" mask="0x00000100" name="SUSPEN" values="USBCSR0__SUSPEN"/>
            <bitfield caption="Suspend Mode status bit" mask="0x00000200" name="SUSPMODE" values="USBCSR0__SUSPMODE"/>
            <bitfield caption="Resume from Suspend control bit" mask="0x00000400" name="RESUME" values="USBCSR0__RESUME"/>
            <bitfield caption="Module Reset Status bit" mask="0x00000800" name="RESET" values="USBCSR0__RESET"/>
            <bitfield caption="Hi-Speed Mode Status bit" mask="0x00001000" name="HSMODE" values="USBCSR0__HSMODE"/>
            <bitfield caption="Hi-Speed Enable bit" mask="0x00002000" name="HSEN" values="USBCSR0__HSEN"/>
            <bitfield caption="Soft Connect/Disconnect Feature Selection bit" mask="0x00004000" name="SOFTCONN" values="USBCSR0__SOFTCONN"/>
            <bitfield caption="ISO Update bit (" mask="0x00008000" name="ISOUPD" values="USBCSR0__ISOUPD"/>
            <bitfield caption="Endpoint 0 Interrupt bit" mask="0x00010000" name="EP0IF" values="USBCSR0__EP0IF"/>
            <bitfield caption="Endpoint 1 TX Interrupt Flag bit" mask="0x00020000" name="EP1TXIF" values="USBCSR0__EP1TXIF"/>
            <bitfield caption="Endpoint 2 TX Interrupt Flag bit" mask="0x00040000" name="EP2TXIF" values="USBCSR0__EP2TXIF"/>
            <bitfield caption="Endpoint 3 TX Interrupt Flag bit" mask="0x00080000" name="EP3TXIF" values="USBCSR0__EP3TXIF"/>
            <bitfield caption="Endpoint 4 TX Interrupt Flag bit" mask="0x00100000" name="EP4TXIF" values="USBCSR0__EP4TXIF"/>
            <bitfield caption="Endpoint 5 TX Interrupt Flag bit" mask="0x00200000" name="EP5TXIF" values="USBCSR0__EP5TXIF"/>
            <bitfield caption="Endpoint 6 TX Interrupt Flag bit" mask="0x00400000" name="EP6TXIF" values="USBCSR0__EP6TXIF"/>
            <bitfield caption="Endpoint 7 TX Interrupt Flag bit" mask="0x00800000" name="EP7TXIF" values="USBCSR0__EP7TXIF"/>
         </register>
         <register caption="USB Control Status Register 1" name="USBCSR1" offset="0x4" rw="RW" size="4">
            <bitfield caption="Endpoint 1 RX Interrupt bit" mask="0x00000002" name="EP1RXIF" values="USBCSR1__EP1RXIF"/>
            <bitfield caption="Endpoint 2 RX Interrupt bit" mask="0x00000004" name="EP2RXIF" values="USBCSR1__EP2RXIF"/>
            <bitfield caption="Endpoint 3 RX Interrupt bit" mask="0x00000008" name="EP3RXIF" values="USBCSR1__EP3RXIF"/>
            <bitfield caption="Endpoint 4 RX Interrupt bit" mask="0x00000010" name="EP4RXIF" values="USBCSR1__EP4RXIF"/>
            <bitfield caption="Endpoint 5 RX Interrupt bit" mask="0x00000020" name="EP5RXIF" values="USBCSR1__EP5RXIF"/>
            <bitfield caption="Endpoint 6 RX Interrupt bit" mask="0x00000040" name="EP6RXIF" values="USBCSR1__EP6RXIF"/>
            <bitfield caption="Endpoint 7 RX Interrupt bit" mask="0x00000080" name="EP7RXIF" values="USBCSR1__EP7RXIF"/>
            <bitfield caption="Endpoint 0 Interrupt Enable bit" mask="0x00010000" name="EP0IE" values="USBCSR1__EP0IE"/>
            <bitfield caption="Endpoint 1 Transmit Interrupt Enable bits" mask="0x00020000" name="EP1TXIE" values="USBCSR1__EP1TXIE"/>
            <bitfield caption="Endpoint 2 Transmit Interrupt Enable bits" mask="0x00040000" name="EP2TXIE" values="USBCSR1__EP2TXIE"/>
            <bitfield caption="Endpoint 3 Transmit Interrupt Enable bits" mask="0x00080000" name="EP3TXIE" values="USBCSR1__EP3TXIE"/>
            <bitfield caption="Endpoint 4 Transmit Interrupt Enable bits" mask="0x00100000" name="EP4TXIE" values="USBCSR1__EP4TXIE"/>
            <bitfield caption="Endpoint 5 Transmit Interrupt Enable bits" mask="0x00200000" name="EP5TXIE" values="USBCSR1__EP5TXIE"/>
            <bitfield caption="Endpoint 6 Transmit Interrupt Enable bits" mask="0x00400000" name="EP6TXIE" values="USBCSR1__EP6TXIE"/>
            <bitfield caption="Endpoint 7 Transmit Interrupt Enable bits" mask="0x00800000" name="EP7TXIE" values="USBCSR1__EP7TXIE"/>
         </register>
         <register caption="USB Control Status Register 2" name="USBCSR2" offset="0x8" rw="RW" size="4">
            <bitfield caption="Endpoint 1 Receive Interrupt Enable bit" mask="0x00000002" name="EP1RXIE" values="USBCSR2__EP1RXIE"/>
            <bitfield caption="Endpoint 2 Receive Interrupt Enable bit" mask="0x00000004" name="EP2RXIE" values="USBCSR2__EP2RXIE"/>
            <bitfield caption="Endpoint 3 Receive Interrupt Enable bit" mask="0x00000008" name="EP3RXIE" values="USBCSR2__EP3RXIE"/>
            <bitfield caption="Endpoint 4 Receive Interrupt Enable bit" mask="0x00000010" name="EP4RXIE" values="USBCSR2__EP4RXIE"/>
            <bitfield caption="Endpoint 5 Receive Interrupt Enable bit" mask="0x00000020" name="EP5RXIE" values="USBCSR2__EP5RXIE"/>
            <bitfield caption="Endpoint 6 Receive Interrupt Enable bit" mask="0x00000040" name="EP6RXIE" values="USBCSR2__EP6RXIE"/>
            <bitfield caption="Endpoint 7 Receive Interrupt Enable bit" mask="0x00000080" name="EP7RXIE" values="USBCSR2__EP7RXIE"/>
            <bitfield caption="Suspend Interrupt bit" mask="0x00010000" name="SUSPIF" values="USBCSR2__SUSPIF"/>
            <bitfield caption="Resume Interrupt bit" mask="0x00020000" name="RESUMEIF" values="USBCSR2__RESUMEIF"/>
            <bitfield caption="Reset/Babble Interrupt bit" mask="0x00040000" name="RESETIF" values="USBCSR2__RESETIF"/>
            <bitfield caption="Start of Frame Interrupt bit" mask="0x00080000" name="SOFIF" values="USBCSR2__SOFIF"/>
            <bitfield caption="Device Connection Interrupt bit" mask="0x00100000" name="CONNIF" values="USBCSR2__CONNIF"/>
            <bitfield caption="Device Disconnect Interrupt bit" mask="0x00200000" name="DISCONIF" values="USBCSR2__DISCONIF"/>
            <bitfield caption="Session Request Interrupt bit" mask="0x00400000" name="SESSRQIF" values="USBCSR2__SESSRQIF"/>
            <bitfield caption="Vbus Error Interrupt bit" mask="0x00800000" name="VBUSERRIF" values="USBCSR2__VBUSERRIF"/>
            <bitfield caption="Suspend Interrupt Enable bit" mask="0x01000000" name="SUSPIE" values="USBCSR2__SUSPIE"/>
            <bitfield caption="Resume Interrupt Enable bit" mask="0x02000000" name="RESUMEIE" values="USBCSR2__RESUMEIE"/>
            <bitfield caption="Reset/Babble Interrupt Enable bit" mask="0x04000000" name="RESETIE" values="USBCSR2__RESETIE"/>
            <bitfield caption="Start of Frame Interrupt Enable bit" mask="0x08000000" name="SOFIE" values="USBCSR2__SOFIE"/>
            <bitfield caption="Device Connection Interrupt Enable bit" mask="0x10000000" name="CONNIE" values="USBCSR2__CONNIE"/>
            <bitfield caption="Device Disconnect Interrupt Enable bit" mask="0x20000000" name="DISCONIE" values="USBCSR2__DISCONIE"/>
            <bitfield caption="Session Request Interrupt Enable bit" mask="0x40000000" name="SESSRQIE" values="USBCSR2__SESSRQIE"/>
            <bitfield caption="Vbus Error Interrupt Enable bit" mask="0x80000000" name="VBUSERRIE" values="USBCSR2__VBUSERRIE"/>
         </register>
